//TESTIT   JOB
//*
//   SET LOADLIB=Z08115.DINO.LOADLIB
//*
//*
//*-------------------------------------------------------------------
//*  RUN THE PROGRAM    COBOL 4.2   NOT OPTIMIZED
//*-------------------------------------------------------------------
//C4NOOPT  EXEC PGM=ZONE4N,REGION=0M
//STEPLIB  DD DISP=SHR,DSN=&LOADLIB.
//SYSPUNCH DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
00000
0   0

//*
//*-------------------------------------------------------------------
//*  RUN THE PROGRAM    COBOL 4.2   OPTIMIZED
//*-------------------------------------------------------------------
//C4OPT    EXEC PGM=ZONE4F,REGION=0M
//STEPLIB  DD DISP=SHR,DSN=&LOADLIB.
//SYSPUNCH DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
00000
0   0

//*
//*-------------------------------------------------------------------
//*  RUN THE PROGRAM    COBOL 6.4   NOT OPTIMIZED
//*-------------------------------------------------------------------
//C6NOOPT  EXEC PGM=ZONE6N,REGION=0M
//STEPLIB  DD DISP=SHR,DSN=&LOADLIB.
//SYSPUNCH DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
00000
0   0

//*
//*-------------------------------------------------------------------
//*  RUN THE PROGRAM    COBOL 6.4   OPTIMIZED
//*-------------------------------------------------------------------
//C6OPT    EXEC PGM=ZONE6F,REGION=0M
//STEPLIB  DD DISP=SHR,DSN=&LOADLIB.
//SYSPUNCH DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
00000
0   0

//*
//*-------------------------------------------------------------------
//*  RUN THE PROGRAM    COBOL 6.4   OPTIMIZED
//*-------------------------------------------------------------------
//ZONED01  EXEC PGM=ZONED01,REGION=0M
//STEPLIB  DD DISP=SHR,DSN=&LOADLIB.
//SYSPUNCH DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
00000
0   0

